src/InformationRegisters/СвязкаПомещениеСотрудник.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>СвязкаПомещениеСотрудник</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Основное</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Помещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Помещения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/СвязкаПомещениеСотрудник/Forms/ФормаСписка/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Сотрудник") Тогда
		Элементы.Список.ПодчиненныеЭлементы.Сотрудник.Видимость = Ложь;
		НовыйОтбор = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		НовыйОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Сотрудник");
		НовыйОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		НовыйОтбор.ПравоеЗначение = Параметры.Сотрудник;
		НовыйОтбор.Использование = Истина;
		ИмяРеквизитаОтбора = "Сотрудник";
	ИначеЕсли Параметры.Свойство("Помещение") Тогда
		Элементы.Список.ПодчиненныеЭлементы.Помещение.Видимость = Ложь;
		Элементы.Список.ПодчиненныеЭлементы.СтруктурнаяЕдиница.Видимость = Ложь;
		Элементы.УстановитьОсновным.Видимость = Ложь;
		НовыйОтбор = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		НовыйОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Помещение");
		НовыйОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		НовыйОтбор.ПравоеЗначение = Параметры.Помещение;
		НовыйОтбор.Использование = Истина;
		ИмяРеквизитаОтбора = "Помещение";
	КонецЕсли;
	
	Если Параметры.Свойство("Заголовок") Тогда
		АвтоЗаголовок = Ложь;
		Заголовок = Параметры.Заголовок;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если ИмяРеквизитаОтбора = "Помещение" ИЛИ ИмяРеквизитаОтбора = "Сотрудник" Тогда
		СтандартнаяОбработка = Ложь;
		ПараметрыФормы = Новый Структура;
		ЗначенияЗаполнения = Новый Структура;
		ЗначенияЗаполнения.Вставить(ИмяРеквизитаОтбора, ИмяРеквизитаОтбора);
		ПараметрыФормы.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);
		ПараметрыФормы.Вставить("Ключ", ВыбраннаяСтрока);
		ОткрытьФорму("РегистрСведений.СвязкаПомещениеСотрудник.ФормаЗаписи",
		ПараметрыФормы,,,,,, 
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы


&НаКлиенте
Процедура Основное(Команда)
	
	Если Элементы.Список.ТекущиеДанные <> Неопределено Тогда
		УстановитьСоответствиеОсновным(Элементы.Список.ТекущиеДанные.Сотрудник, Элементы.Список.ТекущиеДанные.Помещение, Не Элементы.УстановитьОсновным.Пометка);
		Элементы.Список.Обновить();
		Элементы.УстановитьОсновным.Пометка = Элементы.Список.ТекущиеДанные.Основное;
		Оповестить("ОбновленыКабинеты");
	КонецЕсли;
		
КонецПроцедуры
	
&НаСервере
Процедура УстановитьСоответствиеОсновным(Сотрудник, Помещение, УстанавливаемоеЗначение = Истина)
	
	НаборЗаписей = РегистрыСведений.СвязкаПомещениеСотрудник.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Сотрудник.Установить(Сотрудник);
	НаборЗаписей.Прочитать();
	Для Каждого Запись Из НаборЗаписей Цикл
		Если Запись.Помещение.СтруктурнаяЕдиница = Помещение.СтруктурнаяЕдиница Тогда
			Запись.Основное = ?(Запись.Помещение = Помещение, УстанавливаемоеЗначение, Ложь);
		КонецЕсли;
	КонецЦикла;
	НаборЗаписей.Записать();
	
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	Если Элементы.Список.ТекущиеДанные <> Неопределено Тогда
		Элементы.УстановитьОсновным.Пометка = Элементы.Список.ТекущиеДанные.Основное;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
